#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//int main()
//{
//	//int a = -5 % -3;
//	// //取模 - 模一个负数和模正数的结果相同
//	// 结果与左操作数符号相同
//	//printf("%d\n", a);
//	int a = -1;
//	//右移操作符 - a的二进制为右移一位
//	//算术右移 - 右边舍弃，左边补原符号位
//	//逻辑右移 - 右边舍弃，左边补0
//	int b = a >> 1;
//	printf("%d\n", b);
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 2;
//	int b = 5;
//	//& - 按位与
//	//对应的二进制位有一个0则为0，两边都是1则为1
//	//00000000000000000000000000000010
//	//00000000000000000000000000000101
//	//00000000000000000000000000000000
//	//int c = a & b;
//	//printf("%d\n", c);
//
//	//| - 按位或
//	//对应的二进制位有一个1则为1，两边全为0则为0
//	//00000000000000000000000000000010
//	//00000000000000000000000000000101
//	//00000000000000000000000000000111
//	//int c = a | b;
//	//printf("%d\n", c);
//
//	//^ - 按位异或
//	//对应的二进制位两边相同为0，不同为1
//	//00000000000000000000000000000010
//	//00000000000000000000000000000101
//	//00000000000000000000000000000111
//	int c = a ^ b;
//	printf("%d\n", c);
//
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//不使用第三个变量，交换两个整数的值
//	// 1.
//	//存在一定问题，a+b可能会数值溢出
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//	//2.
//	//采用异或的方法
//	a = a ^ b;//a - 011    a ^ a = 0    0 ^ a = a
//	b = a ^ b;//b = a ^ b ^ b    b ^ b = 0    a ^ 0 = a
//	a = a ^ b;//a = a ^ b ^ a    a ^ a = 0    b ^ 0 = b
//
//	return 0;
//}
//统计一个整数储存在内存中的二进制序列有几个1
//#include <stdio.h>
//int count_1(int);
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int ret = count_1(n);
//	//int ret = n & 1;
//	printf("%d\n", ret);
//	return 0;
//}
//int count_1(int n)
//{
//	/*int ret = 0;
//	while (n)
//	{
//		if (n & 1)
//		{
//			ret++;
//		}
//		n = n >> 1;
//	}*/
//	if (n)
//	{
//		return ((n & 1) + count_1(n >> 1));
//	}
//	return 0;
//}


//按位或                            按位与
//改变二进制中的某一位由0变成1      改变二进制中的某一位由1变成0
//11010                             11010
//00100                             10111
//11110                             10010

#include <stdio.h>
int main()
{
	int a = 13;
	a = -a;
	a = +a;
	//int b = a | (1 << 4);
	//// ~ - 按位取反
	//a = b & (~(1 << 4));
	//printf("%d\n", b);
	printf("%d\n", a);
	return 0;
}
